abelykh0/stm32h750-z80emu/Disabled/camera/canvas.c
#include "stm32h7xx_hal.h"
#include "string.h"

#include "camera/canvas.h"
#include "usbd_core.h"
#include "usbd_desc.h"
#include "usbd_video_if.h"

extern JPEG_HandleTypeDef hjpeg;
extern PCD_HandleTypeDef hpcd_USB_OTG_FS;
extern USBD_HandleTypeDef hUsbDeviceFS;

uint8_t canvas[] __attribute__(( section(".sram2") ));
static Mcu* canvasMcu = (Mcu*)canvas;

// Y-Cb-Cr 64 color palette (indexed by BBGGRR)
uint8_t Colors[][3] =
{
	/*000000*/ {16, 128, 128},
	/*000001*/ {38, 115, 165},
	/*000010*/ {60, 103, 203},
	/*000011*/ {82, 90, 240},
	/*000100*/ {59, 103, 97},
	/*000101*/ {81, 91, 134},
	/*000110*/ {103, 78, 171},
	/*000111*/ {124, 66, 209},
	/*001000*/ {102, 79, 65},
	/*001001*/ {124, 66, 103},
	/*001010*/ {145, 53, 140},
	/*001011*/ {167, 41, 177},
	/*001100*/ {145, 54, 34},
	/*001101*/ {166, 41, 71},
	/*001110*/ {188, 29, 109},
	/*001111*/ {210, 16, 146},
	/*010000*/ {24, 165, 122},
	/*010001*/ {46, 153, 159},
	/*010010*/ {68, 140, 197},
	/*010011*/ {90, 128, 234},
	/*010100*/ {67, 141, 91},
	/*010101*/ {89, 128, 128},
	/*010110*/ {111, 115, 165},
	/*010111*/ {133, 103, 203},
	/*011000*/ {110, 116, 59},
	/*011001*/ {132, 103, 97},
	/*011010*/ {154, 91, 134},
	/*011011*/ {176, 78, 171},
	/*011100*/ {153, 91, 28},
	/*011101*/ {175, 79, 65},
	/*011110*/ {197, 66, 103},
	/*011111*/ {218, 53, 140},
	/*100000*/ {33, 203, 116},
	/*100001*/ {55, 190, 153},
	/*100010*/ {76, 177, 191},
	/*100011*/ {98, 165, 228},
	/*100100*/ {76, 178, 85},
	/*100101*/ {97, 165, 122},
	/*100110*/ {119, 153, 159},
	/*100111*/ {141, 140, 197},
	/*101000*/ {118, 153, 53},
	/*101001*/ {140, 141, 91},
	/*101010*/ {162, 128, 128},
	/*101011*/ {184, 115, 165},
	/*101100*/ {161, 128, 22},
	/*101101*/ {183, 116, 59},
	/*101110*/ {205, 103, 97},
	/*101111*/ {227, 91, 134},
	/*110000*/ {41, 240, 110},
	/*110001*/ {63, 227, 147},
	/*110010*/ {85, 215, 185},
	/*110011*/ {107, 202, 222},
	/*110100*/ {84, 215, 79},
	/*110101*/ {106, 203, 116},
	/*110110*/ {128, 190, 153},
	/*110111*/ {149, 177, 191},
	/*111000*/ {127, 190, 47},
	/*111001*/ {149, 178, 85},
	/*111010*/ {170, 165, 122},
	/*111011*/ {192, 153, 159},
	/*111100*/ {170, 166, 16},
	/*111101*/ {191, 153, 53},
	/*111110*/ {213, 141, 91},
	/*111111*/ {235, 128, 128}
};

void Clear(uint8_t color)
{
	uint8_t colorIndex = color & 0x3F;
	uint8_t yValue =  Colors[colorIndex][0];
	uint8_t cbValue = Colors[colorIndex][1];
	uint8_t crValue = Colors[colorIndex][2];

	for (int i = 0; i < MCU_WIDTH * MCU_HEIGHT; i++)
	{
		Mcu* mcu = &canvasMcu[i];
		memset(mcu->y,  yValue,  8 * 8 * H_SAMP_FACTOR);
		memset(mcu->cb, cbValue, 8 * 8);
		memset(mcu->cr, crValue, 8 * 8);
	}
}

// UVC_WIDTH x UVC_HEIGHT pixels
void SetPixel(uint16_t x, uint16_t y, uint8_t color)
{
	if (x >= UVC_WIDTH || y >= UVC_HEIGHT)
	{
		return;
	}

	uint8_t colorIndex = color & 0x3F;
	Mcu* mcu = &canvasMcu[x / 8 / H_SAMP_FACTOR + (y / 8 * MCU_WIDTH)];
	uint8_t xOffset = x % 8;
	uint8_t yOffset = y % 8;

	uint8_t Y  = Colors[colorIndex][0];
    uint8_t Cb = Colors[colorIndex][1];
    uint8_t Cr = Colors[colorIndex][2];

#if (CHROMA_FORMAT == 444)
	mcu->y[0][yOffset][xOffset] = Y;
#elif (CHROMA_FORMAT == 422)
	int block = x / 8 % H_SAMP_FACTOR;
	mcu->y[block][yOffset][xOffset] = Y;
#endif

	mcu->cb[yOffset][xOffset] = Cb;
	mcu->cr[yOffset][xOffset] = Cr;
}

static void USB_DEVICE_Init()
{
	  if (USBD_Init(&hUsbDeviceFS, &FS_Desc, DEVICE_FS) != USBD_OK)
	  {
	    Error_Handler();
	  }

	  // Defaults are 128, 64, 128 (320 total)
	  HAL_PCDEx_SetRxFiFo(&hpcd_USB_OTG_FS,    48);
	  HAL_PCDEx_SetTxFiFo(&hpcd_USB_OTG_FS, 0, 16);
	  HAL_PCDEx_SetTxFiFo(&hpcd_USB_OTG_FS, 1, 256);

	  if (USBD_RegisterClass(&hUsbDeviceFS, &USBD_VIDEO) != USBD_OK)
	  {
	    Error_Handler();
	  }
	  if (USBD_VIDEO_RegisterInterface(&hUsbDeviceFS, &USBD_VIDEO_fops_FS) != USBD_OK)
	  {
	    Error_Handler();
	  }
	  if (USBD_Start(&hUsbDeviceFS) != USBD_OK)
	  {
	    Error_Handler();
	  }
}

void InitCamera()
{
	USB_DEVICE_Init();
	JPEG_ConfTypeDef config;
	config.ImageWidth = UVC_WIDTH;
	config.ImageHeight = UVC_HEIGHT;
	config.ColorSpace = JPEG_YCBCR_COLORSPACE;
	#if (CHROMA_FORMAT == 444)
	config.ChromaSubsampling = JPEG_444_SUBSAMPLING;
	#else
	config.ChromaSubsampling = JPEG_422_SUBSAMPLING;
	#endif
	config.ImageQuality = 80;
	HAL_JPEG_ConfigEncoding(&hjpeg, &config);
}
